#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
tf/env/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/tcry.pt/tcry.pt/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/tcry.pt/tcry.pt

To view this run in a browser, visit:
https://app.terraform.io/app/tcrypt/production-tcrypt/runs/run-3X39HTFWE3dcHseC

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.tcrypt.digitalocean_spaces_bucket.gomods: Refreshing state... [id=tcrypt-gomods]
module.tcrypt.digitalocean_volume.storage_1: Refreshing state... [id=ebf89721-1338-11eb-9461-0a58ac1420e9]
module.tcrypt.digitalocean_floating_ip.beacon: Refreshing state... [id=167.99.27.68]
module.tcrypt.digitalocean_vpc.region_1: Refreshing state... [id=2b0aaf42-a9b4-4226-aeb3-32acc2973103]
module.tcrypt.digitalocean_domain.beacon_domain: Refreshing state... [id=beacon.tcry.pt]
module.tcrypt.digitalocean_droplet.compute_beacon: Refreshing state... [id=215858473]
module.tcrypt.digitalocean_spaces_bucket.s3: Refreshing state... [id=tcrypt-s3]
module.tcrypt.digitalocean_record.web_docker_record: Refreshing state... [id=119173065]
module.tcrypt.digitalocean_record.web_go_record: Refreshing state... [id=119173060]
module.tcrypt.digitalocean_domain.root_domain: Refreshing state... [id=tcry.pt]
module.tcrypt.digitalocean_record.web_code_record: Refreshing state... [id=119173059]
module.tcrypt.digitalocean_spaces_bucket.docker-registry: Refreshing state... [id=tcrypt-docker]
module.tcrypt.data.template_file.cloud_init: Refreshing state... [id=0aadfaefbbc915fead90297fe577d60875e3149c25654d9d3e54e36ad13cbff6]
module.tcrypt.digitalocean_droplet.compute_worker_1: Refreshing state... [id=215858490]
module.tcrypt.digitalocean_floating_ip.proxy_1: Refreshing state... [id=167.172.9.215]
module.tcrypt.digitalocean_record.mail_mx["1"]: Refreshing state... [id=119173137]
module.tcrypt.digitalocean_record.mail_cname["0"]: Refreshing state... [id=119173067]
module.tcrypt.digitalocean_record.mail_cname["2"]: Refreshing state... [id=119173068]
module.tcrypt.digitalocean_record.mail_mx["0"]: Refreshing state... [id=119173136]
module.tcrypt.digitalocean_record.mail_cname["1"]: Refreshing state... [id=119173061]
module.tcrypt.digitalocean_record.mail_verification["0"]: Refreshing state... [id=119173063]
module.tcrypt.digitalocean_record.mail_verification["2"]: Refreshing state... [id=119173062]
module.tcrypt.digitalocean_record.mail_verification["1"]: Refreshing state... [id=119173064]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.tcrypt.digitalocean_domain.beacon_domain will be destroyed
  - resource "digitalocean_domain" "beacon_domain" {
      - id         = "beacon.tcry.pt" -> null
      - ip_address = "167.99.27.68" -> null
      - name       = "beacon.tcry.pt" -> null
      - urn        = "do:domain:beacon.tcry.pt" -> null
    }

  # module.tcrypt.digitalocean_domain.root will be created
  + resource "digitalocean_domain" "root" {
      + id         = (known after apply)
      + ip_address = "167.172.9.215"
      + name       = "tcry.pt"
      + urn        = (known after apply)
    }

  # module.tcrypt.digitalocean_domain.root_domain will be destroyed
  - resource "digitalocean_domain" "root_domain" {
      - id         = "tcry.pt" -> null
      - ip_address = "167.172.9.215" -> null
      - name       = "tcry.pt" -> null
      - urn        = "do:domain:tcry.pt" -> null
    }

  # module.tcrypt.digitalocean_droplet.compute_beacon will be destroyed
  - resource "digitalocean_droplet" "compute_beacon" {
      - backups              = false -> null
      - created_at           = "2020-11-08T01:52:33Z" -> null
      - disk                 = 25 -> null
      - id                   = "215858473" -> null
      - image                = "ubuntu-20-04-x64" -> null
      - ipv4_address         = "157.245.232.225" -> null
      - ipv4_address_private = "10.2.0.2" -> null
      - ipv6                 = true -> null
      - ipv6_address         = "2604:a880:2:d1::bb:9001" -> null
      - locked               = false -> null
      - memory               = 1024 -> null
      - monitoring           = true -> null
      - name                 = "compute-beacon" -> null
      - price_hourly         = 0.00744 -> null
      - price_monthly        = 5 -> null
      - private_networking   = true -> null
      - region               = "sfo2" -> null
      - resize_disk          = true -> null
      - size                 = "s-1vcpu-1gb" -> null
      - status               = "active" -> null
      - tags                 = [] -> null
      - urn                  = "do:droplet:215858473" -> null
      - user_data            = "20d68dcdf79463c79bd295f954b433314bf3d733" -> null
      - vcpus                = 1 -> null
      - volume_ids           = [] -> null
      - vpc_uuid             = "2b0aaf42-a9b4-4226-aeb3-32acc2973103" -> null
    }

  # module.tcrypt.digitalocean_droplet.compute_beacon_1 will be created
  + resource "digitalocean_droplet" "compute_beacon_1" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = true
      + ipv6_address         = (known after apply)
      + ipv6_address_private = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "compute-beacon-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "sfo2"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + user_data            = "20d68dcdf79463c79bd295f954b433314bf3d733"
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = "2b0aaf42-a9b4-4226-aeb3-32acc2973103"
    }

  # module.tcrypt.digitalocean_floating_ip.beacon will be destroyed
  - resource "digitalocean_floating_ip" "beacon" {
      - droplet_id = 215858473 -> null
      - id         = "167.99.27.68" -> null
      - ip_address = "167.99.27.68" -> null
      - region     = "sfo2" -> null
      - urn        = "do:floatingip:167.99.27.68" -> null
    }

  # module.tcrypt.digitalocean_floating_ip.beacon_1 will be created
  + resource "digitalocean_floating_ip" "beacon_1" {
      + droplet_id = (known after apply)
      + id         = (known after apply)
      + ip_address = (known after apply)
      + region     = "sfo2"
      + urn        = (known after apply)
    }

  # module.tcrypt.digitalocean_record.beacon will be created
  + resource "digitalocean_record" "beacon" {
      + domain = "tcry.pt"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "beacon"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.tcrypt.digitalocean_record.code will be created
  + resource "digitalocean_record" "code" {
      + domain = "tcry.pt"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "*"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "167.172.9.215"
    }

  # module.tcrypt.digitalocean_record.web_code_record will be destroyed
  - resource "digitalocean_record" "web_code_record" {
      - domain   = "tcry.pt" -> null
      - flags    = 0 -> null
      - fqdn     = "code.tcry.pt" -> null
      - id       = "119173059" -> null
      - name     = "code" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "167.172.9.215" -> null
      - weight   = 0 -> null
    }

  # module.tcrypt.digitalocean_record.web_docker_record will be destroyed
  - resource "digitalocean_record" "web_docker_record" {
      - domain   = "tcry.pt" -> null
      - flags    = 0 -> null
      - fqdn     = "docker.tcry.pt" -> null
      - id       = "119173065" -> null
      - name     = "docker" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "167.172.9.215" -> null
      - weight   = 0 -> null
    }

  # module.tcrypt.digitalocean_record.web_go_record will be destroyed
  - resource "digitalocean_record" "web_go_record" {
      - domain   = "tcry.pt" -> null
      - flags    = 0 -> null
      - fqdn     = "go.tcry.pt" -> null
      - id       = "119173060" -> null
      - name     = "go" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "167.172.9.215" -> null
      - weight   = 0 -> null
    }

Plan: 5 to add, 0 to change, 7 to destroy.
```

</details>

*Pusher: @tyler-smith, Action: `pull_request`*